## PANDAS Introduction --> 

One of the most powerful  and open-source Python libraries for data analysis and manipulation. 🐼📊

1) Pandas is a Python library used to:

2) Work with tabular data (like Excel, CSV, databases)

3) Handle and clean dataframes

4) Perform filtering, sorting, grouping, merging, and much more

It provides two main data structures:
 
Structure	   /    Description

Series	  ---->   1D labeled array (like a column)

DataFrame ---->	  2D table with rows & columns (like Excel or SQL table)

In [ ]:
#!pip install pandas --> intalling of pandas

In [1]:
import pandas as pd    #  --> importing of pandas

In [2]:
# data Structure of pandas 
# a) Series --> It is one - dimensional array and its shows only vaulues.
# b) DataFrame --> It is multi - dimensional array and it contains values with column name .

##  (a) . Series

In [4]:
a = pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

## (b) . DataFrame

In [9]:
a = {
    "Emp_ID" : [1,2,3,4,5],
    "Name" : ["sam","raj","rahul","rohan","pallavi"],
    "department": ['IT','Sales','IT','sales','IT'],
    "salary" : [20000,25000,14555,13555,25003]
}

In [10]:
df = pd.DataFrame(a)
df

   Emp_ID     Name department  salary
0       1      sam         IT   20000
1       2      raj      Sales   25000
2       3    rahul         IT   14555
3       4    rohan      sales   13555
4       5  pallavi         IT   25003

In [11]:
df.to_csv("C:\Users\HP\OneDrive\Desktop\regex python - Copy\PANDAS\29Apr,Pandas intro.ipynb"

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (676237765.py, line 1)

In [ ]:
      arr = np.array([1, 4, 5, 8, 11])
a=[]
c=[]
indicator=0
for num in arr:
    if num % 2 == 0:
        # print(f"{num} is even")
        a.append(num)
        print(a)
    else:
        # print(f"{num} is odd")
        c.append(num)
        print(c)